import React, {Component} from 'react';
import {Link} from "react-router-dom";
import ConstructorsChild from './ConstructorsChild';

class Constructors extends Component {
    constructor(props) {
        super(props);
        this.patterns = [
            {
                label: "Свободные заказы",
                categories: [
                    {name: '#'},
                    {name: 'Комменты'},
                    {name: 'Появился'},
                    {name: 'Статус'},
                    {name: 'Инфа'},
                    {name: 'Заключился'},
                    {name: 'Конструктор'},
                    {name: 'Замер'},
                    {name: 'Профиль'},
                    {name: 'Тип'},
                    {name: 'Наполнение'},
                    {name: 'Фурнитура'}
                ],
                items: [
                    ['f0000', 'Открыть', '03-11', 'Новый',
                        <a>Открыть</a>, '09-11', 'Выбрать', 'Открыть', 'Optima 45x45', 'Складная', 'Стекло мат 5мм', 'Дегон'], ['f0000', 'Открыть', '03-11', 'Новый',
                        <a>Открыть</a>, '09-11', 'Выбрать', 'Открыть', 'Optima 45x45', 'Складная', 'Стекло мат 5мм', 'Дегон'], ['f0000', 'Открыть', '03-11', 'Новый',
                        <a>Открыть</a>, '09-11', 'Выбрать', 'Открыть', 'Optima 45x45', 'Складная', 'Стекло мат 5мм', 'Дегон'], ['f0000', 'Открыть', '03-11', 'Новый',
                        <a>Открыть</a>, '09-11', 'Выбрать', 'Открыть', 'Optima 45x45', 'Складная', 'Стекло мат 5мм', 'Дегон']
                ]
            },
            {
                label: "Выполняются",
                categories: [
                    {name: '#'},
                    {name: 'Комменты'},
                    {name: 'Заключился'},
                    {name: 'Конструктор'},
                    {name: 'Начало'},
                    {name: 'Окончания'},
                    {name: 'Замер'},
                    {name: 'Чертежи'},
                    {name: 'Смета'},
                    {name: 'Профиль'},
                    {name: 'Тип'},
                    {name: 'Наполнение'},
                    {name: 'Фурнитура'}
                ],
                items: [
                    ['f0000', 'Открыть', '03-11', 'Димка', '04-11', '06-11', 'Открыть', <Link
                        to={'/constructors/download/f0000'}>Загрузить</Link>, 'Загрузить', 'Optima 45x45', 'Складная', 'Стекло мат 5мм', 'Дегон'],
                    ['f0000', 'Открыть', '03-11', 'Димка', '04-11', '06-11', 'Открыть', 'Загрузить', 'Загрузить', 'Optima 45x45', 'Складная', 'Стекло мат 5мм', 'Дегон'],
                    ['f0000', 'Открыть', '03-11', 'Димка', '04-11', '06-11', 'Открыть', 'Загрузить', 'Загрузить', 'Optima 45x45', 'Складная', 'Стекло мат 5мм', 'Дегон'],
                    ['f0000', 'Открыть', '03-11', 'Димка', '04-11', '06-11', 'Открыть', 'Загрузить', 'Загрузить', 'Optima 45x45', 'Складная', 'Стекло мат 5мм', 'Дегон']
                ]
            }, {
                label: "Проверка",


                categories:
                    [
                        {name: '#'},
                        {name: 'Комменты'},
                        {name: 'Проверка'},
                        {name: 'Ревизор'},
                        {name: 'Инфа'},
                        {name: 'Заключился'},
                        {name: 'Конструктор'},
                        {name: 'Чертежи'},
                        {name: 'Замер'},
                        {name: 'Профиль'},
                        {name: 'Тип'},
                        {name: 'Наполнение'},
                        {name: 'Фурнитура'}
                    ],
                items:
                    []
            },
            {
                label: "Cогласования",
                categories:
                    [
                        {name: '#'},
                        {name: 'Комменты'},
                        {name: 'Заключился'},
                        {name: 'Конструктор'},
                        {name: 'Отправка'},
                        {name: 'Тип'},
                        {name: 'Профиль'},
                        {name: 'Наполнение'},
                        {name: 'Фурнитура'}
                    ],
                items:
                    []
            }
        ]
        ;
    }

    renderListTables() {
        return this.patterns.map(i => <ConstructorsChild pattern={i}/>);
    };

    render() {
        return (<div className={'container-fluid'}>
                <div className={'row'}>
                    {this.renderListTables()}
                </div>
            </div>
        );
    }
}

export default Constructors;